Revit 2026 API

# ModelCurveArrArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ModelCurveArrArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
ModelCurveArrArrayIterator()
```
```fsharp
new : unit -> ModelCurveArrArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

ModelCurveArrArrayIterator Class

Autodesk.Revit.DB Namespace